# 야구게임 만들기
# 1. 컴퓨터는 3개의 랜덤한 숫자를 위치를 지정하여 입력한다. 단 숫자 3개는 겹치지 않아야 한다.
# 2. 사용자는 랜덤한 숫자 3개를 입력해 컴퓨터가 돌린 랜덤한 숫자와 비교하여 결과를 출력한다.
# 3. 출력한 결과는 아래의 조건을 따른다
#   * 만약 숫자가 동일하고 위치가 맞는다면 : 스트라이크
#       - 3스트라이크일 경우 게임 종료
#   * 동일한 숫자가 있지만 위치가 다를경우 : 볼
#   * 플래이어가 고른 숫자가 컴퓨터가 고른 숫자와 하나도 위치하지 않을 경우 : 아웃
#
# * 플래이어는 3스트라이크가 될 때까지 게임을 진행하여 몇번만에 3스트라이크가 되었는지를
#   출력하면 됨
#   예 ) "3스트라이크 7번만에 이닝 종료"
#   예 ) "2S 1B 0O

from random import *
# 로직
# - 초기값 설정
# 컴퓨터가 3개의 랜덤한 값을 입력받아 리스트에 저장한다.
    # 겹치는 숫자가 있을 경우 해당 숫자를 넣지 않고 다시 재굴림

c = []
while len(c) < 3:
    ran1 = randint(1, 9)
    if ran1 not in c :
        c.append(ran1)
print("컴퓨터 랜덤 값 : {}".format(c))

# 스트라이크, 볼, 아웃을 저장하는 변수가 각각 하나씩 생성
s1 = 0
b1 = 0
o1 = 1

# 카운트 증가 변수
cnt1 = 0

# - 로직 실행
# 반복구간 시작 -> 3S가 될 때까지
while s1 != 3:
    user1 = []
    s1 = 0
    b1 = 0
    o1 = 1
    # 유저가 3개의 값을 입력받는다
    for i in range(3):
        # 1~9 수를 리스트에 입력받아서 저장
        user1.append(int(input("{}번째 수를 입력하세요".format(i+1))))

    # 비교해서 결과를 출력
    for i in range(3):
        # 1. 사용자가 입력한 리스트의 각 위치와 숫자를 컴퓨터의 리스트의 숫자와 위치를 비교해서
        # 하나라도 맞으면 스트라이크를 카운트
        if user1[i] == c[i]:
            s1 += 1
            o1 = 0
        # 2. 사용자가 입력한 리스트 내부의 3개의 값 중 하나라도 리스트 안에 들어가 있으면 볼 카운트
        elif user1[i] in c:
            b1 += 1
            o1 = 0

        # 3. 사용자가 입력한 값이 리스트 내에 단 한개도 없다면 아웃 카운트
    # 4. 스트라이크 볼 아웃을 출력하고 초기화
    print("{}S {}B {}O".format(s1, b1, o1))
    # 5. 횟수 카운트 증가
    cnt1 += 1

# 반복구간 끝나게 되었을 시 인닝 종료라는 문구를 출력 몇번에 걸쳐서 3S 가 되었는지 출력
print("{}회 만에 이닝 종료".format(cnt1))