# 가위바위보 게임
# 1. 컴퓨터가 랜덤한 값을 통해 "가위", "바위", "보" 중 하나를 선택한다.
# 2. 사용자가 입력을 받아 "가위", "바위", "보" 중 하나를 선택한다.
# 3. 두 값을 비교하여 만약 두 값이 동일하면 "비겼습니다"를 출력
# 4. 사용자가 "가위" / "바위" / "보" 일 때 컴퓨터가 "바위" / "보" / "가위" 이면 "졌습니다"를 출력
# 5. 사용자가 "가위" / "바위" / "보" 일 때 컴퓨터가 "보" / "가위" / "바위" 이면 "이겼습니다"를 출력
# 된다면 3선승으로 조건을 바꿔서 출력 -> 이건 여러분들이 해보시는 걸로

# 심화 : 다음만을 활용해서 로직을 작성해 보세요
#     1. if ~ elif ~ else 문 1개만 활용
#     2. 논리연산자를 사용 금지
#     3. 삼항연산자 사용 금지


from random import *
# 승리의 경우
rcp_dic = {"가위":"보", "바위":"가위", "보":"바위"}

win = 0
while win != 3:
    # 컴퓨터가 랜덤한 값 출력
    computer = choice(["가위", "바위", "보"])
    print(computer)

    # 사용자가 랜덤한 값 입력
    user = input("가위 바위 보 중 한개를 선택하여 입력하세요: ")

    # 만약 사용자가 가위인데 컴퓨터가 보라면 이겼습니다 출력
    # 만약 사용자가 바위인데 컴퓨터가 가위라면 이겼습니다 출력
    # 만약 사용자가 보인데 컴퓨터가 바위라면 이겼습니다 출력
    if rcp_dic[user] == computer:
        win += 1
        print("이겼습니다")

    # 만약 사용자와 컴퓨터가 같은걸 냈다면 비겼습니다 출력
    elif user == computer:
        print("비겼습니다.")

    # 나머지는 졌습니다 출력
    else:
        print("졌습니다.")

print("3승 하였습니다.")